import os
import math

if __name__ == '__main__':
    a = float(input("Введите значение a: "))
    b = float(input("Введите значение b: "))
    c = float(input("Введите значение c: "))
    x1 = 0
    x2 = 0
    d = 0
    os.system('cls')
    if a != 0 and b > 0 and c > 0:
        print(f"Вы сформировали уравнение: {a}x^2+{b}x+{c}=0")
    elif a != 0 and b > 0 and c < 0:
        print(f"Вы сформировали уравнение: {a}x^2+{b}x{c}=0")
    elif a != 0 and b < 0 and c > 0:
        print(f"Вы сформировали уравнение: {a}x^2{b}x+{c}=0")
    elif a != 0 and b < 0 and c < 0:
        print(f"Вы сформировали уравнение: {a}x^2{b}x{c}=0")
    elif a == 0 and b != 0 and c > 0:
        print(f"Вы сформировали уравнение: {b}x+{c}=0")
    elif a == 0 and b != 0 and c < 0:
        print(f"Вы сформировали уравнение: {b}x{c}=0")
    elif a != 0 and b == 0 and c > 0:
        print(f"Вы сформировали уравнение: {a}x^2+{c}=0")
    elif a != 0 and b == 0 and c < 0:
        print(f"Вы сформировали уравнение: {a}x^2{c}=0")
    elif a != 0 and b > 0 and c == 0:
        print(f"Вы сформировали уравнение: {a}x^2+{b}x=0")
    elif a != 0 and b < 0 and c == 0:
        print(f"Вы сформировали уравнение: {a}x^2{b}x=0")
    if a == 0:
        x1 = -c / b
        print(f"\033[0mПервый корень уравнения равен: \033[36m\033[03m{x1}")
        print(f"\033[0mВторой корень уравнения равен: \033[36m\033[03m{x2}")
    elif c == 0:
        x1 = -b / a
        print(f"\033[0mПервый корень уравнения равен: \033[36m\033[03m{x1}")
        print(f"\033[0mВторой корень уравнения равен: \033[36m\033[03m{x2}")
    elif b == 0:
        x1 = math.sqrt(-c / a)
        x2 = -x1
        print(f"\033[0mПервый корень уравнения равен: \033[36m\033[03m{x1}")
        print(f"\033[0mВторой корень уравнения равен: \033[36m\033[03m{x2}")
    else:
        d = b ** 2 - 4 * a * c
        if d > 0:
            x1 = (-b + math.sqrt(d)) / (2 * a)
            x2 = (-b - math.sqrt(d)) / (2 * a)
            print(f"\033[0mПервый корень уравнения равен: \033[36m\033[03m{x1}")
            print(f"\033[0mВторой корень уравнения равен: \033[36m\033[03m{x2}")
        elif d == 0:
            x1 = (-b + math.sqrt(d)) / (2 * a)
            print(f"\033[0mПервый корень уравнения равен: \033[36m\033[03m{x1}")
            print(f"\033[0mВторой корень уравнения равен: \033[36m\033[03m{x2}")
        else:
            print("\033[0m\033[02m\033[31m\033[03mДействительных корней нет")

